using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 Тимур Самигуллин
    2. Модифицировать программу нахождения минимума функции так, чтобы можно было передавать функцию в виде делегата.
        а) Сделайте меню с различными функциями и предоставьте пользователю выбор, для какой функции и на каком отрезке находить минимум.
        б) Используйте массив (или список) делегатов, в котором хранятся различные функции.
        в) *Переделайте функцию Load, чтобы она возвращала массив считанных значений. Пусть она
            возвращает минимум через параметр.
 */
namespace L06HW_02
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
